dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxEmem_mpu_reg.h
/** \brief 12C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU1_RGNACCEN5_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB01012Cu)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN5_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN5_RGNACCENRB.
*/
#define EMEMMPU1_RGNACCENRB5 (EMEMMPU1_RGNACCEN5_RGNACCENRB)

/** \brief 138, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU1_RGNACCEN6_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB010138u)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN6_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN6_RGNACCENRA.
*/
#define EMEMMPU1_RGNACCENRA6 (EMEMMPU1_RGNACCEN6_RGNACCENRA)

/** \brief 13C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU1_RGNACCEN6_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB01013Cu)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN6_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN6_RGNACCENRB.
*/
#define EMEMMPU1_RGNACCENRB6 (EMEMMPU1_RGNACCEN6_RGNACCENRB)

/** \brief 148, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU1_RGNACCEN7_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB010148u)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN7_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN7_RGNACCENRA.
*/
#define EMEMMPU1_RGNACCENRA7 (EMEMMPU1_RGNACCEN7_RGNACCENRA)

/** \brief 14C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU1_RGNACCEN7_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB01014Cu)
/** Alias (User Manual Name) for EMEMMPU1_RGNACCEN7_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU1_RGNACCEN7_RGNACCENRB.
*/
#define EMEMMPU1_RGNACCENRB7 (EMEMMPU1_RGNACCEN7_RGNACCENRB)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Emem_mpu_Registers_Cfg_Ememmpu2
 * \{  */
/** \brief 0, EMEM Module Clock Control Register */
#define EMEMMPU2_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_CLC*)0xFB020000u)

/** \brief 8, EMEM Module ID Register */
#define EMEMMPU2_MODID /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_MODID*)0xFB020008u)

/** \brief 10, EMEM Module Access Enable Register 0 */
#define EMEMMPU2_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_ACCEN0*)0xFB020010u)

/** \brief 14, EMEM Module Access Enable Register 1 */
#define EMEMMPU2_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_ACCEN1*)0xFB020014u)

/** \brief 20, EMEM Module Memory Control Register */
#define EMEMMPU2_MEMCON /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_MEMCON*)0xFB020020u)

/** \brief 24, EMEM Module Safety Control Register */
#define EMEMMPU2_SCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_SCTRL*)0xFB020024u)

/** \brief 50, EMEM Module Region i Lower Address Register */
#define EMEMMPU2_RGNWRN0_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB020050u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN0_RGNLA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN0_RGNLA.
*/
#define EMEMMPU2_RGNLA0 (EMEMMPU2_RGNWRN0_RGNLA)

/** \brief 54, EMEM Module Region i Upper Address Register */
#define EMEMMPU2_RGNWRN0_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB020054u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN0_RGNUA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN0_RGNUA.
*/
#define EMEMMPU2_RGNUA0 (EMEMMPU2_RGNWRN0_RGNUA)

/** \brief 58, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU2_RGNWRN0_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB020058u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN0_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN0_RGNACCENWA.
*/
#define EMEMMPU2_RGNACCENWA0 (EMEMMPU2_RGNWRN0_RGNACCENWA)

/** \brief 5C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU2_RGNWRN0_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB02005Cu)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN0_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN0_RGNACCENWB.
*/
#define EMEMMPU2_RGNACCENWB0 (EMEMMPU2_RGNWRN0_RGNACCENWB)

/** \brief 60, EMEM Module Region i Lower Address Register */
#define EMEMMPU2_RGNWRN1_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB020060u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN1_RGNLA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN1_RGNLA.
*/
#define EMEMMPU2_RGNLA1 (EMEMMPU2_RGNWRN1_RGNLA)

/** \brief 64, EMEM Module Region i Upper Address Register */
#define EMEMMPU2_RGNWRN1_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB020064u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN1_RGNUA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN1_RGNUA.
*/
#define EMEMMPU2_RGNUA1 (EMEMMPU2_RGNWRN1_RGNUA)

/** \brief 68, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU2_RGNWRN1_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB020068u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN1_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN1_RGNACCENWA.
*/
#define EMEMMPU2_RGNACCENWA1 (EMEMMPU2_RGNWRN1_RGNACCENWA)

/** \brief 6C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU2_RGNWRN1_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB02006Cu)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN1_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN1_RGNACCENWB.
*/
#define EMEMMPU2_RGNACCENWB1 (EMEMMPU2_RGNWRN1_RGNACCENWB)

